---
title: FreeFormElement
classe: Autodesk.Revit.DB.FreeFormElement
namespace: Autodesk.Revit.DB
eredita: Autodesk.Revit.DB.GenericForm
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 4
---

# FreeFormElement

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Boolean CanOffsetFace(Face)` | `freeFormElement.CanOffsetFace(face)` | Boolean |
| `FreeFormElement Create(Document, Solid)` | `FreeFormElement.Create(document, geometry)` | FreeFormElement |
| `Void SetFaceOffset(Face, Double)` | `freeFormElement.SetFaceOffset(face, offset)` | Void |
| `Void UpdateSolidGeometry(Solid)` | `freeFormElement.UpdateSolidGeometry(newGeometry)` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```